IDEA Open Model
FatigueMethod Enumeration
Compatible with IDEA StatiCa 20.1
 Verification of concrete under compression or shear
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum FatigueMethod
Public Enumeration FatigueMethod
Members
Member name | Value | Description
notSet | 0 |  the method has not been set
Method_6_8_7_1 | 1 |  method 6.8.7 (1) according to EN 1992-1-1
Method_6_8_7_2 | 2 |  method 6.8.7 (2) according to EN 1992-1-1
Method_6_8_7_101 | 3 |  method 6.8.7 (101) according to EN 1992-2
Method_6_8_7_101_ANNEX_NEN | 4 |  method 6.8.7 (101) according to EN 1992-2
Method_Shear_6_8_7_4 | 5 |  6.8.7 Verification of concrete under compression or shear
Method_Reinf_6_8_5_3 | 6 |  6.8.5 Verification using damage equivalent stress range - reinfrocement
Method_Prestress_6_8_5_3 | 7 |  6.8.5 Verification using damage equivalent stress range - prestress
Method_NN112 | 8 |  EN 1992-2, annex NN eq. NN.112
Method_Reinf_NN102 | 9 |  reinforcement EN 1992-2, annex NN eq. NN.102
Method_Reinf_NN107 | 10 |  reinforcement EN 1992-2, annex NN eq. NN.107
Method_Tendon_NN102 | 11 |  tendon EN 1992-2, annex NN eq. NN.102
Method_Tendon_NN107 | 12 |  tendon EN 1992-2, annex NN eq. NN.107
Method_6_8_7_2_Shear | 13 |  method 6.8.7 (2) according to EN 1992-1-1 under shear
Method_Reinf_6_8_5_3_Shear | 14 |  6.8.5 Verification of concrete under compression or shear
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace